
//http 401
// 您的Web服务器认为，客户端（例如您的浏览器或我们的 CheckUpDown 机器人）发送的 HTTP 数据流是正确的，
// 但进入网址 (URL) 资源 ， 需要用户身份验证e5a48de588b6e79fa5e9819331333363353862 ，
// 而相关信息 1 ）尚未被提供, 或 2 ）已提供但没有通过授权测试。这就是通常所知的“ HTTP 基本验证 ”。
// 需客户端提供的验证请求在 HTTP 协议中被定义为 WWW – 验证标头字段 (WWW-Authenticate header field) 。 　　
// 一般来说该错误消息表明您首先需要登录（输入有效的用户名和密码）。
// 如果你刚刚输入这些信息，立刻就看到一个 401 错误，就意味着，
// 无论出于何种原因您的用户名和密码其中之一或两者都无效（输入有误，用户名暂时停用，等） 。

// http 403
// 403错误，是网站访问过程中，常见的错误提示。
// 资源不可用。服务器理解客户的请求，但拒绝处理它。
// 通常由于服务器上文件或目录的权限设置导致，比如IIS或者apache 设置了访问权限不当。